jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* UPDATE ----------------------------------------------------------------------*/
#define SDRAM_ADDR_UPDATE             0xC0000000         // 1M

/* LOGO ----------------------------------------------------------------------*/
#define COMMON_DATA_M_SP_NA_1              1            // 单点信息
#define COMMON_DATA_M_DP_NA_1              3            // 双点信息
#define COMMON_DATA_M_ME_NA_1              9            // 测量值，归一化值
#define COMMON_DATA_M_ME_NB_1              11           // 测量值，标度化值
#define COMMON_DATA_M_ME_NC_1              13           // 测量值，短浮点数
#define COMMON_DATA_M_SP_TB_1              30           // 带时标的单点信息
#define COMMON_DATA_M_DP_TB_1              31           // 带时标的双点信息
#define COMMON_DATA_M_FT_NA_1              42           // 故障事件信息
#define COMMON_DATA_M_IT_NB_1              206          // 累计量，短浮点数
#define COMMON_DATA_M_IT_TC_1              207          // 带时标累计量，短浮点数

/* ADDR ----------------------------------------------------------------------*/
#define TELESIGNAL_START_ADDR         0x0001      // 遥信起始地址
#define TELEMETRY_START_ADDR          0x4001      // 遥测起始地址
#if RT_USING_TELEMETRY_SET
#define TELEMETRY_SETENABLE_START_ADDR    0x4801      // 遥测置数使能起始地址
#define TELEMETRY_SETVALUE_START_ADDR     0x4881      // 遥测置数值起始地址
#endif
#define REMOTE_START_ADDR             0x6001      // 遥测起始地址
#define INTRIPARAME_START_ADDR        0x8001      // 终端固有参数起始地址
#define RUNPARAMETER_START_ADDR       0x8101      // 终端运行参数起始地址
#define CALIBRATE_FACTOR_START_ADDR   0x8201    	// 校准系数起始地址
#define CALIBRATE_VALUE_START_ADDR    0x8240    	// 校准值起始地址
#define PUBLIC_VALUE_START_ADDR       0x8301	    // 终端保护公共定值起始地址
#define BREAKER_VALUE_START_ADDR      0x8401    	// 终端保护断路器定值起始地址
#define LOAD_SWITCH_VALUE_START_ADDR  0x8501  	  // 终端保护负荷开关定值起始地址


#define DISTANT_REMOTE_ADDR           0x6001      // 远方操作
#define DISTANT_ACTIVE_ADDR           0x6002      // 活化操作
#define DISTANT_RESET_ADDR            0x6003      // 复归操作
#define DISTANT_CLAER_HISTORY_ADDR    0x6004      // 远程清除记录
#define LOCAL_OPERATION_ADDR          0x6005      // 本地操作
#define LOCAL_RESET_ADDR              0x6006      // 复归操作
#define LOCAL_CLAER_HISTORY_ADDR      0x6007      // 本地清除记录
#define LOCAL_REMOTE_ADDR             0x6008      // 本地遥控操作 (小白)


#define OPEN_SELECT_FAIL              0x01 | 0x20 // 遥控分闸选择失败  00000001
#define OPEN_SELECT_SUCCESS           0x05 | 0x20 // 遥控分闸选择成功  00000101
#define OPEN_EXECUTE_FAIL             0x09 | 0x20 // 遥控分闸执行失败  00001001						   
#define OPEN_EXECUTE_SUCCESS          0x0D | 0x20 // 遥控分闸执行成功  00001101						   							  							   
#define CLOSE_SELECT_FAIL             0x02 | 0x20 // 遥控合闸选择失败  00000010
#define CLOSE_SELECT_SUCCESS          0x06 | 0x20 // 遥控合闸选择成功  00000110
#define CLOSE_EXECUTE_FAIL            0x0A | 0x20 // 遥控合闸执行失败  00001010
#define CLOSE_EXECUTE_SUCCESS         0x0E | 0x20 // 遥控合闸执行成功  00001110
#define CLOSE_LOOP_SELECT_FAIL        0x03 | 0x20 // 合环选择失败      00000011
#define CLOSE_LOOP_SELECT_SUCCESS     0x07 | 0x20 // 合环选择成功      00000111
#define CLOSE_LOOP_EXECUTE_FAIL       0x0B | 0x20 // 合环执行失败      00001011
#define CLOSE_LOOP_EXECUTE_SUCCESS    0x0F | 0x20 // 合环执行成功      00001111
#define DISTANT_REMOTE_CANCEL         0x10        // 遥控取消

/* VALUE ----------------------------------------------------------------------*/
#define PULSE_TIME                    100.0f      // 分合闸脉宽时间
#define ENERGY_STORAGE_TIME           10000       // 储能时间
#define DEVICE_FAULT_TIME             10000       // 装置故障时间
#define LOOP_DISCONNECT_TIME          5000        // 控制回路断线时间

#define RATIO0                        200 / 5
#define RATIO1                        400 / 5
#define RATIO2                        600 / 5
#define RATIO3                        800 / 5
#define RATIO4                        1000 / 5

#define DEADZONE_U                    (20.0f)
#define DEADZONE_U0                   (20.0f)
#define DEADZONE_I                    (20.0f)
#define DEADZONE_I0                   (20.0f)
#define DEADZONE_P                    (20.0f)
#define RATED_VALUE_U                 (100.0f)
#define RATED_VALUE_U0                (57.74f)
#define RATED_VALUE_I                 (5.0f)
#define RATED_VALUE_I0                (1.0f)
#define RATED_VALUE_P                 (0.5f)
#define RATED_VALUE_Q                 (0.5f)
#define RATED_VALUE_S                 (0.5f)
#define RATED_VALUE_PF                (1.0f)


#define DEADZONE_UP                   (100.0f)
#define DEADZONE_DOWN                 (1.0f)
#define DEADZONE_DEFAULT              (20.0f)

/* OPER ----------------------------------------------------------------------*/
/* 开出操作类型枚举 */
enum DoOperateType
{
    DO_CLOSE = 1,                      // 合闸
    DO_CLOSE_RECOVERY,                 // 合闸收回
    DO_OPEN,                           // 分闸
    DO_OPEN_RECOVERY,                  // 分闸收回
    DO_COIL_ENERGY_STORAGE,            // 线圈储能
    DO_ALARM_LED,                      // 告警灯
    DO_BATTERY_ACTIVE,                 // 电池活化启动
    DO_BATTERY_ACTIVE_RECOVERY,	       // 活化启动收回
    DO_BATTERY_ACTIVE_END,             // 电池活化结束
    DO_BATTERY_ACTIVE_END_RECOVERY,    // 活化结束收回
    DO_BATTERY_DROP_OUT,               // 电池退出
    DO_BATTERY_DROP_OUT_RECOVERY,	   // 电池退出收回
};
/* 遥控操作动作类型 */
enum ActReasion
{
    REMOTE = 1,                // 遥控
    LOCAL,                     // 本地操作
    DISTANCE,                  // 远方
    LOGIC_ACT,                 // 逻辑动作
    OTHER                      // 其他
};

/* FRAM----------------------------------------------------------------------*/
#define ADDR_FRAM_AREA0_INHERENT        0x00001	 // FRAM参数存储起始地址 0区固有参数
#define ADDR_FRAM_AREA0_RUN             0x00100	 // FRAM参数存储起始地址 运行参数0区
#define ADDR_FRAM_AREA1		            0x00350	 // FRAM参数存储起始地址	定值区一    
#define ADDR_FRAM_AREA2		            0x00600	 // FRAM参数存储起始地址	定值区二     0x250
#define ADDR_FRAM_SOE                   0x00850  // FRAM参数存储起始地址 SOE  // 0xA00
#define ADDR_FRAM_FEVENT                0x01250  // 故障事件起始地址 0x500
#define ADDR_FRAM_CO                    0x01750  // 操作记录起始地址 0x300
#define ADDR_FRAM_LOG                   0x01A50  // 日志起始地址 0x1000
#define ADDR_FRAM_MEMORY                0x02A50  // 日志起始地址 0x100

