jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
#define ADDR_FRAM_TELISIGNAL            0x02B50  // 遥信起始地址   0x50
#define ADDR_FRAM_CONFIG                0x02C00  // 配置起始地址   0x400

#define ADDR_FRAM_SOE_NEW               0x03000  // FRAM参数存储起始地址 SOE  // 0x300
/* flag */                                        

#define ADDR_FRAM_UPDATE                0x03FF0  // 在线更新 2字节
#define ADDR_FRAM_START_NUM             0x03FF2  // 开机次数一个字节

#define ADDR_FRAM_CURRENT_SN            0x03FF5  // 当前定值区号
#define ADDR_FRAM_MONITOR               0x03FFE  // FRAM自检

/* FRAM区域枚举 */
enum FramArea
{
    VALUE_AREA0,                       // 定值区0
    VALUE_AREA1,                       // 定值区1
    VALUE_AREA2,                       // 定值区2
    SOE_RECODE,                        // SOE数据
    SOE_NEW_RECODE,                    // 新SOE数据
    FEVENT_RECODE,                     // FAULT_EVENT数据
    CO_RECODE,                         // 操作记录  
    LOG_RECODE,                        // 日志记录   
	MEMORY_FLAG,                       // 记录标志缓存
    CFG_RECODE,                        // 配置    
    TELESIGNAL,                        // 遥信数据
    CURRENT_SN,                        // 当前定值区号
    FRAM_AREA_NUM                      // 分区数量
};

enum UpdateState
{
    UPDATE_START,    // 升级启动
	UPDATE_COMPLATE, // 更新完成
	UPDATE_BACK,     // 回退
	RUN_NOMAL        // 运行正常
};

struct RecordStateType
{
	uint8_t flag;
	int32_t position;
	int32_t num;
};

/* DATABASE----------------------------------------------------------------------*/
/* database数据操作类型 */
enum TelesignalAddr
{
    ADDR_CAP_UNDER_VOLTAGE = 0x03,                        // 电容欠压(储能开入)
    ADDR_LOW_PRESSURE,                                    // 低气压
    ADDR_POWERFAULTALARM,                                 // 电源故障告警
    ADDR_BATTERY_UNDERVOLTAGE_ALARM,                      // 电池欠压告警
    ADDR_BATTERYACTIVATIONSTATUS,                         // 电池活化状态
    ADDR_BATTERY_LOSS_ALARM,                              // 电池失电告警
    ADDR_BREAK_CONTACT,                                   // 分断/联络
    ADDR_RECLOSEHARDSTRAP,                                // 重合硬压板
    ADDR_FUNCTION_HARDSTRAP,                              // 功能投退硬压板
    ADDR_REMOTE_EARTH,                                    // 远方/就地
    ADDR_SHORT_CIRCUIT_FAULT,                             // 短路故障/过流保护
    ADDR_EARTHING_FAULT,                                  // 接地故障/零序保护
    ADDR_PROTECTION_ACT,                                  // 保护动作
    ADDR_PROTECTION_CLOCK,                                // 保护闭锁
    ADDR_CLOSING_CLOCK,                                   // 合闸闭锁
    ADDR_OPENING_CLOCK,                                   // 分闸闭锁    
    ADDR_RECLOSE_ACT,                                     // 重合动作
    ADDR_RECLOSE_CLOCK,                                   // 重合闸闭锁
    ADDR_DEVICE_FAULT,                                    // 装置故障
    ADDR_SELF_CHECK_ABNOMAL,                              // 自检异常
    ADDR_CPMMUNICATION,                                   // 通讯 
    ADDR_SWTICHCLASS,                                     // 开关类型
    ADDR_BATTERY_FAULT_ALARM,                             // 电池故障告警
    ADDR_DOUBLE_SWITCH,                                   // 双点开关分合
    ADDR_CONTROL_LOOP_DISCONNECTION,                      // 控制回路断线
    ADDR_OVERCURRENT_IA_1,                                // A相过流一段保护
    ADDR_OVERCURRENT_IB_1,                                // B相过流一段保护
    ADDR_OVERCURRENT_IC_1,                                // C相过流一段保护
    ADDR_OVERCURRENT_IA_2,                                // A相过流二段保护
    ADDR_OVERCURRENT_IB_2,                                // A相过流二段保护
    ADDR_OVERCURRENT_IC_2,	                              // A相过流二段保护
    ADDR_OVERCURRENT_IA_3,                                // A相过流三段保护
    ADDR_OVERCURRENT_IB_3,                                // A相过流三段保护
    ADDR_OVERCURRENT_IC_3,	                              // A相过流三段保护
    ADDR_OVERCURRENT_I0_1,                                // 零序过流一段保护
    ADDR_OVERCURRENT_I0_2,	                              // 零序过流二段保护
    ADDR_OVERCURRENT_ACC_IA,                              // A相后加速过流
    ADDR_OVERCURRENT_ACC_IB,                              // B相后加速过流
    ADDR_OVERCURRENT_ACC_IC,                              // C相后加速过流
    ADDR_OVERCURRENT_INVERSE_IA,                          // A相反时限过流
    ADDR_OVERCURRENT_INVERSE_IB,                          // B相反时限过流
    ADDR_OVERCURRENT_INVERSE_IC,                          // C相反时限过流
    ADDR_RECLOSE_PROTECTION_1,                            // 重合闸一次保护
    ADDR_RECLOSE_PROTECTION_2,                            // 重合闸二次保护
    ADDR_RECLOSE_PROTECTION_3,                            // 重合闸三次保护
    ADDR_RECLOSE_PROTECTION_4,                            // 重合闸四次保护
    ADDR_RECLOSE_CLOCK_PROTECTION,                        // 重合闸闭锁保护
    ADDR_ZERO_RECLOSE_PROTECTION_1,                       // 零序重合闸一次保护
    ADDR_ZERO_RECLOSE_PROTECTION_2,                       // 零序重合闸二次保护
    ADDR_CLOCK_SECONDARY_CLOSE,                           // 闭锁二次重合闸
    ADDR_LOSS_TRIP,                                       // 失电跳闸
    ADDR_GET_CLOSSING_EVENT,                              // 得电合闸事件
    ADDR_CLOSING_FAULT,                                   // 合闸于故障
    ADDR_PROTECT_CLOCK,                                   // 保护闭锁
    ADDR_DOUBLE_PROHIBIT_CLOSSING,                        // 双侧有压禁止合闸
    ADDR_SINGLE_LOSS_CLOSING_EVENT,                       // 单侧失压延时合闸事件
    ADDR_REMAIN_CLOCK_CLOSSING,                           // 残压闭锁合闸
    ADDR_U0_EARTHING_FAULT_TRIP,                          // 零序电压接地故障跳闸
    ADDR_SMALL_SIGNAL_GROUND_LINE_TRIP,                   // 小信号接地选线跳闸
    ADDR_BREAKINGCURRENT,                                 // 遮断电流
    ADDR_OVERLOAD_EVENT,                                  // 过负荷事件
    ADDR_HAVEY_OVERLOAD_EVENT,                            // 重过载	
    ADDR_OVER_VOLTAGE_PROTECTION,                         // 过压保护
	ADDR_OVER_FREQUEBNCY_PROTECTION,                      // 过频
    ADDR_DOWN_VOLTAGE_PROTECTION,                         // 低压保护
	ADDR_DOWN_FREQUEBNCY_PROTECTION,                      // 低频		
    ADDR_OVER_LIMIT_UA_UP,                                // A相电压越限
    ADDR_OVER_LIMIT_UA_DOWN,                              // A相电压越限
    ADDR_OVER_LIMIT_UB_UP,                                // B相电压越限
    ADDR_OVER_LIMIT_UB_DOWN,                              // B相电压越限
    ADDR_OVER_LIMIT_UC_UP,                                // C相电压越限
    ADDR_OVER_LIMIT_UC_DOWN,                              // C相电压越限
    ADDR_OVER_LIMIT_U0_UP,                                // 零序电压越限
    ADDR_OVER_LIMIT_U0_DOWN,                              // 零序电压越限
    ADDR_OVER_LIMIT_IA_UP,                                // A相电流越限
    ADDR_OVER_LIMIT_IA_DOWN,                              // A相电流越限
    ADDR_OVER_LIMIT_IB_UP,                                // B相电流越限
    ADDR_OVER_LIMIT_IB_DOWN,                              // B相电流越限
    ADDR_OVER_LIMIT_IC_UP,                                // C相电流越限
    ADDR_OVER_LIMIT_IC_DOWN,                              // C相电流越限
    ADDR_OVER_LIMIT_I0_UP,                                // 零序电流越限
    ADDR_OVER_LIMIT_I0_DOWN,                              // 零序电流越限
    ADDR_OVER_LIMIT_DC_U_UP,                              // 直流电压越限
    ADDR_OVER_LIMIT_DC_U_DOWN,                            // 直流电压越限
    ADDR_OVER_LIMIT_DC_I_UP,                              // 直流电流越限
    ADDR_OVER_LIMIT_DC_I_DOWN,                            // 直流电流越限
    ADDR_DEVICE_POWER_DOWN,                               // 装置掉电
};

/* 遥信数据 */
typedef union TagTelesignalDatabase
{
    struct Telesignal
    {
        rt_uint8_t switchOpen;               // 开关分位
        rt_uint8_t switchClose;              // 开关合位
        rt_uint8_t operatingMechanism;       // 弹簧储能/永磁电容欠压
        rt_uint8_t lowPressure;              // 低气压
        rt_uint8_t powerFaultAlarm;          // 电源故障告警
        rt_uint8_t batteryUnderVoltageAlarm; // 电池欠压告警
        rt_uint8_t batteryActivationStatus;  // 电池活化状态
        rt_uint8_t batteryLossAlarm;         // 电池失电告警
        rt_uint8_t breakContact;             // 分断/联络	(模式)
        union
        {
            rt_uint8_t recloseHardStrap;     // 重合闸硬压板
            rt_uint8_t faHardStrap;          // FA功能投退硬压板
        } FA;
        rt_uint8_t functionHardStrap;        // 功能投退硬压板
        rt_uint8_t remoteEarth;              // 远方/就地
        rt_uint8_t shortCircuitFault;        // 短路故障/过流保护
        rt_uint8_t earthingFault;            // 接地故障/零序保护
        rt_uint8_t protectionAct;            // 保护动作
        rt_uint8_t protectionLock;           // 保护闭锁
        rt_uint8_t closingLocked;            // 合闸闭锁
        rt_uint8_t openingLockedEvent;       // 分闸闭锁事件
        rt_uint8_t recloseAct;               // 重合动作
        rt_uint8_t recloseLock;  			  // 重合闭锁
        rt_uint8_t deviceFault;              // 装置故障
		rt_uint8_t selfCheckAbnomal;         // 自检异常
		rt_uint8_t communication;            // 通讯
        rt_uint8_t swtichclass;              // 开关类型		
        rt_uint8_t batteryLowVoltageAlarm;   // 蓄电池低压告警(直流量)
        rt_uint8_t doubleSwitch;             // 双点开关分合
        rt_uint8_t controlLoopDisconnection; // 控制回路断线
        rt_uint8_t overcurrentIa1;           // A相过流一段保护
        rt_uint8_t overcurrentIb1;           // B相过流一段保护
        rt_uint8_t overcurrentIc1;           // C相过流一段保护
        rt_uint8_t overcurrentIa2;           // A相过流二段保护
        rt_uint8_t overcurrentIb2;           // B相过流二段保护
        rt_uint8_t overcurrentIc2;           // C相过流二段保护
        rt_uint8_t overcurrentIa3;           // A相过流三段保护
        rt_uint8_t overcurrentIb3;           // B相过流三段保护
        rt_uint8_t overcurrentIc3;           // C相过流三段保护
        rt_uint8_t overcurrentI01;           // 零序过流一段保护
        rt_uint8_t overcurrentI02;           // 零序过流二段保护
        rt_uint8_t overcurrentAccIa;		  // A相后加速过流
        rt_uint8_t overcurrentAccIb;		  // B相后加速过流
        rt_uint8_t overcurrentAccIc;		  // C相后加速过流
        rt_uint8_t overcurrentInverseIa;	  // A相反时限过流
        rt_uint8_t overcurrentInverseIb;	  // B相反时限过流
        rt_uint8_t overcurrentInverseIc;	  // C相反时限过流
        rt_uint8_t recloseProtection1;		  // 重合闸一次保护
        rt_uint8_t recloseProtection2;		  // 重合闸二次保护
        rt_uint8_t recloseProtection3;		  // 重合闸三次保护
        rt_uint8_t recloseProtection4;		  // 重合闸四次保护
        rt_uint8_t recloseClockProtection;	  // 重合闸闭锁保护
        rt_uint8_t zeroRecloseProtection1;   // 零序重合闸一次保护
        rt_uint8_t zeroRecloseProtection2;   // 零序重合闸二次保护
        rt_uint8_t clockSecondaryClose;      // 闭锁二次重合闸
        rt_uint8_t lossTrip;                 // 失电跳闸
        rt_uint8_t getClossingEvent;		  // 得电合闸事件
        rt_uint8_t closingFaultEvent;        // 合闸于故障
        rt_uint8_t protectionLockedEvent;    // 保护闭锁事件
        rt_uint8_t doubleProhibitClossing;   // 双侧有压禁止合闸
        rt_uint8_t singleLossClosingEvent;   // 单侧失压延时合闸事件
        rt_uint8_t remainClockClossing;      // 残压闭锁合闸
        rt_uint8_t earthingFaultTripU0;      // 零序电压接地故障跳闸
        rt_uint8_t smallSignalEarthingTrip;  // 小信号接地选线跳闸
        rt_uint8_t breakingCurrent;          // 遮断电流
        rt_uint8_t overloadEvent;            // 过负荷事件		
        rt_uint8_t haveyOverload;            // 重过载
        rt_uint8_t overVoltageProtection;    // 过压保护
        rt_uint8_t overFrequencyProtection;  // 过频保护		
        rt_uint8_t downVoltageProtection;    // 低压保护	
        rt_uint8_t downFrequencyProtection;  // 低频保护
        rt_uint8_t overLimitUaUp;            // A相电压越上限
        rt_uint8_t overLimitUaDown;          // A相电压越下限
        rt_uint8_t overLimitUbUp;            // B相电压越上限
        rt_uint8_t overLimitUbDown;          // B相电压越下限
        rt_uint8_t overLimitUcUp;            // C相电压越上限
        rt_uint8_t overLimitUcDown;          // C相电压越下限
        rt_uint8_t overLimitU0Up;            // 零序电压越上限
        rt_uint8_t overLimitU0Down;          // 零序电压越下限
        rt_uint8_t overLimitIaUp;            // A相电压越上限
        rt_uint8_t overLimitIaDown;          // A相电压越下限
        rt_uint8_t overLimitIbUp;            // B相电压越上限
        rt_uint8_t overLimitIbDown;          // B相电压越下限
        rt_uint8_t overLimitIcUp;            // C相电压越上限
        rt_uint8_t overLimitIcDown;          // C相电压越下限
        rt_uint8_t overLimitI0Up;            // 零序电压越上限
        rt_uint8_t overLimitI0Down;          // 零序电压越下限
        rt_uint8_t overLimitDC_U_Up;         // 直流电压越上限
        rt_uint8_t overLimitDC_U_Down;       // 直流电压越下限
        rt_uint8_t overLimitDC_I_Up;         // 直流电流越限
        rt_uint8_t overLimitDC_I_Down;       // 直流电流越限
        rt_uint8_t devicePowerDown;          // 装置掉电
    }Str;

    rt_uint8_t buf[sizeof(struct Telesignal)];

}TelesignalDatabase;

enum TelemetryAddr
{
    ADDR_IA = 0x4002,
    ADDR_IB,
    ADDR_IC,
    ADDR_I0,
    ADDR_Uab,
    ADDR_Ubc,
    ADDR_Uac,
    ADDR_U0,
    ADDR_UAB,
    ADDR_UBC,
};
    
/* 遥测数据 */
typedef union TagTelemetryDatabase
{
    struct Telemetry
    {
        float frequency;                // 频率
        float Ia;                       // A相电流
        float Ib;                       // B相电流
        float Ic;                       // C相电流
        float I0;                       // 零序电流
        float Uab;                      // 线电压Uab
        float Ubc;                      // 线电压Ubc
        float Uac;                      // 线电压Uac
        float U0;                       // 零序电压
        float UAB;                      // 线电压Uab
        float UBC;                      // 线电压Ubc
        float P;                        // 有功功率
        float Q;                        // 无功功率
        float S;                        // 视在功率
        float pf;                       // 功率因数
        float Alpha0;                    // 零序夹角
        float AlphaU;                    // 电源测负载测电压夹角		
        float DCVoltage;                // 直流电压
        float DCSpare;                  // 直流量备用
        float temprature;               // 温度
        float onceIa;                   // A相电流
        float onceIb;                   // B相电流
        float onceIc;                   // C相电流
        float onceI0;                   // 零序电流
        float onceUab;                  // 线电压Uab
        float onceUbc;                  // 线电压Ubc
        float onceUac;                  // 线电压Uac
        float onceU0;                   // 零序电压
        float onceUAB;                  // 线电压UAB
        float onceUBC;                  // 线电压UBC
        float onceP;                    // 有功功率
        float onceQ;                    // 无功功率
        float onceS;                    // 视在功率
        float voltagePassRate;          // 电压合格率
        float thirdHarmonicUab;         // 三次谐波
        float thirdHarmonicUbc;         // 三次谐波
        float thirdHarmonicUac;         // 三次谐波
        float thirdHarmonicU0;          // 三次谐波
        float thirdHarmonicIa;          // 三次谐波
        float thirdHarmonicIb;          // 三次谐波
        float thirdHarmonicIc;          // 三次谐波
        float thirdHarmonicI0;          // 三次谐波
        float fifthHarmonicUab;         // 五次谐波
        float fifthHarmonicUbc;         // 五次谐波
        float fifthHarmonicUac;         // 五次谐波
        float fifthHarmonicU0;          // 五次谐波
        float fifthHarmonicIa;          // 五次谐波
        float fifthHarmonicIb;          // 五次谐波
        float fifthHarmonicIc;          // 五次谐波
        float fifthHarmonicI0;          // 五次谐波
    }Str;

    float buf[sizeof(struct Telemetry) / sizeof(float)];
}TelemetryDatabase;

