jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* PARA ----------------------------------------------------------------------*/
#define RT_SYS_CONFIG_DEFAULT                           \
{                                                       \
    "F31                     ",                         \
    "RT-Thread               ",                         \
    "                        ",                         \
    "HV01.01                 ",                         \
    "SV03.021                ",                         \
    "CRC                     ",                         \
    "101 / 104               ",                         \
    "SJFD2000                ",                         \
    "F31xxxxxxxxx20171211xxxx",                         \
    "                        ",	                        \
    TERMINAL_PRODUCT_SERIAL_NUMBER                      \
}

#define SIZEOFINTRIPARAME             24          // 固有参数长度

#define SN_MIN                        0           // 最小定值区号
#define SN_MAX                        2           // 最大定值区号
#define DB_SN0                        0           // 0区
#define DB_SN1                        1           // 1区
#define DB_SN2                        2           // 2区

enum ParameterType
{
    ZERODRIFT,
    DEADZONE,
    CALIBRATE_FACTOR,
};

struct Inherent
{
    char terminalType[SIZEOFINTRIPARAME];                      // 终端类型
    char terminalOpreatSystem[SIZEOFINTRIPARAME];              // 终端操作系统
    char terminalManufacturer[SIZEOFINTRIPARAME];              // 终端制造商
    char terminalHardwareVersion[SIZEOFINTRIPARAME];           // 终端硬件版本
    char terminalSoftwareVersion[SIZEOFINTRIPARAME];           // 终端软件版本
    char terminalSoftwareVersionCheckCode[SIZEOFINTRIPARAME];  // 终端软件版本校验码
    char terminalCommunicationProtocolType[SIZEOFINTRIPARAME]; // 终端通信规约类型
    char terminalFactoryModel[SIZEOFINTRIPARAME];              // 终端出厂型号
    char terminalID[SIZEOFINTRIPARAME];                        // 终端ID号
    char terminalMAC[SIZEOFINTRIPARAME];                       // 终端网卡MAC地址
    char terminalProductSerialNumber[SIZEOFINTRIPARAME];                       // 终端产品序列号
};

		
typedef union TagInherentPara
{
    struct Inherent Str;
    char buf[sizeof(struct Inherent) / sizeof(char)];
} InherentPara;

// 运行参数
typedef union TagRunParameter
{
    struct Run
    {
        float operatingMechanism;                 // 操作机构(0-弹簧/1-永磁)
		float switchType;						  // 开关类型(0-断路器/1-负荷开关)
		float breakWorkMode;                      // 断路器工作模式(0-无/1-常规保护/2-电压时间型/3-电压电流型/4-电流计数型)
		float loadWorkMode;                       // 负荷开关工作模式(0-无/1-电压时间型/2-电压电流型/3-电流计数型/4-分界负荷开关型)
		float connectSwitchRecognize;             // 联络开关识别
        float outputOverturn;                     // 永磁输出翻转
        float capUnderVoltageClosing;	          // 合闸电容欠压定值
        float capUnderVoltageOpening;             // 分闸电容欠压定值
        float capUnderVoltageFactor;			  // 电容欠压返回系数 
        float ratioUOneTurn;                      // 电压变比一次		
        float ratioUSecondary;                    // 电压变比二次
		float ratioU0OneTurn;                     // 零序电压变比一次
        float ratioU0Secondary;                   // 零序电压变比二次
		float ratioIOneTurn;                      // 电流变比一次		
        float ratioISecondary;                    // 电流变比二次
		float ratioI0OneTurn;                     // 零序电流一次变比
        float ratioI0Secondary;                   // 零序电流二次变比		        
        float diShakingTime;                      // 开入采集防抖时间 
        float closingPulseTime;                   // 合闸脉宽时间
        float openingPulseTime;			          // 分闸脉宽时间
        float reverseTime;                        // 反校时间
        float zerodriftF;                         // 频率零漂
        float zerodriftIa;                        // A相电流零漂
        float zerodriftIb;                        // B相电流零漂
        float zerodriftIc;                        // C相电流零漂
        float zerodriftI0;                        // 零序电流零漂
        float zerodriftUab;                       // 线电压Uab零漂
        float zerodriftUbc;                       // 线电压Ubc零漂
        float zerodriftUac;                       // 线电压Uac零漂
        float zerodriftU0;                        // 零序电压零漂
        float zerodriftUAB;                       // 线电压Uab零漂
        float zerodriftUBC;                       // 线电压Ubc零漂
        float zerodriftP;                         // 有功功率零漂
        float zerodriftQ;                         // 无功功率零漂
        float zerodriftS;                         // 视在功率零漂
        float zerodriftPF;                        // 功率因数零漂
        float zerodriftDC;                        // 直流电压零漂
        float zerodriftDC2;                       // 直流电压2零漂
        float zerodriftT;                         // 温度零漂
        float deadzoneF;                          // 频率死区
        float deadzoneIa;                         // A相电流死区
        float deadzoneIb;                         // B相电流死区
        float deadzoneIc;                         // C相电流死区
        float deadzoneI0;                         // 零序电流死区
        float deadzoneUab;                        // 线电压Uab死区
        float deadzoneUbc;                        // 线电压Ubc死区
        float deadzoneUac;                        // 线电压Uac死区
        float deadzoneU0;                         // 零序电压死区
        float deadzoneUAB;                        // 线电压Ubc死区
        float deadzoneUBC;                        // 线电压Uac死区
        float deadzoneP;                          // 有功功率死区
        float deadzoneQ;                          // 无功功率死区
        float deadzoneS;                          // 视在功率死区
        float deadzonePf;                         // 功率因数死区
        float deadzoneDC;                         // 直流电压死区
        float deadzoneDC2;                        // 直流量2死区
        float deadzoneT;				          // 温度死区
    } Str;

    float buf[sizeof(struct Run) / sizeof(float)];   // 终端运行参数存储区
} RunParameter;

// 校准系数
typedef union TagCalibrateFactor
{
    struct Calibrate
    {
        float califactorF;                        // 频率校准系数
        float califactorIa;                       // A相电流(Ia)校准系数
        float califactorIb;                       // B相电流(Ib)校准系数
        float califactorIc;                       // C相电流(Ic)校准系数
        float califactorI0;                       // 零序电流(I0)校准系数
        float califactorUab;                      // 线电压(Uab)校准系数
        float califactorUbc;                      // 线电压(Ubc)校准系数
        float califactorUac;                      // 线电压(Uac)校准系数
        float califactorU0;                       // 零序电压(U0)校准系数
        float califactorUAB;                      // 线电压(Uab)校准系数
        float califactorUBC;                      // 线电压(Ubc)校准系数
        float califactorP;                        // 有功功率(p)校准系数（无效）
        float califactorQ;                        // 无功功率(Q)校准系数（无效）
        float califactorS;                        // 视在功率(S)校准系数（无效）
        float califactorPf;                       // 功率因数(Pf)校准系数（无效）
        float califactorL0;                       // 零序角度(L)校准系数（无效）   
        float califactorU;                        // 电压角度(U)校准系数（无效）   		
        float califactorDC;                       // 直流电压(V)校准系数
        float califactorDC2;                      // 直流电压(V)校准系数
        float califactorT;			              // 温度(T)校准系数
        float califactorAlphaUaIa;	              // 角UaIa校准系数
        float califactorAlphaUbIb;	              // 角UbIb校准系数
        float califactorAlphaUcIc;	              // 角UcIc校准系数
        float califactorAlphaU0I0;	              // 角UcIc校准系数
        float califactorAlphaUaUb;	              // 角UaUb校准系数		
    } Str;

    float buf[sizeof(struct Calibrate) / sizeof(float)];

} CalibrateFactor;


// 公共定值
typedef union TagPublicValue
{
    struct Public
    {
        float overCurrentSwitch1;                // 过流1段投退 “1投入”、“0退出”
        float directionLockSwitch1;              // 过流1段方向闭锁 “1投入”、“0退出”
        float overCurrentValue1;                 // 过流1段电流 流定值，整定范围：00.00A~99.99A
        float overCurrentTime1;                  // 过流1段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentSwitch2;                // 过流2段投退 “1投入”、“0退出”
        float directionLockSwitch2;              // 过流2段方向闭锁 “1投入”、“0退出”
        float overCurrentValue2;                 // 过流2段电流 电流定值，整定范围：00.00A~99.99A
        float overCurrentTime2;                  // 过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentSwitch3;                // 过流3段投退 “1投入”、“0退出”
        float directionLockSwitch3;              // 过流3段方向闭锁 “1投入”、“0退出”
        float overCurrentValue3;                 // 过流3段电流 电流定值，整定范围：00.00A~99.99A
        float overCurrentTime3;                  // 过流3段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Switch1;              // 零序过流1段投退 “1投入”、“0退出”
        float overCurrentI0Value1;               // 零序过流1段电流 流定值，整定范围：00.00A~99.99A
        float overCurrentI0Time1;                // 零序过流1段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Switch2;              // 零序过流2段投退 “1投入”、“0退出”
        float overCurrentI0Value2;               // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Time2;                // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overlimitAlarmSwitch;              // 越限报警功能投退
        float uplimitFactor;                     // 越限上限系数
        float downlimitFactor;                   // 越限下限系数
        float overlimitTime;                     // 越限延时
        float overlimitAlarmSwitchUab;           // Uab越限报警投退
        float overlimitAlarmSwitchUbc;           // Ubc越限报警投退
        float overlimitAlarmSwitchUac;           // Uac越限报警投退
        float uplimitVoltageU;                   // 电压上限定值
        float downlimitVoltageU;                 // 电压下限定值
        float overlimitAlarmSwitchIa;            // Ia越限报警投退
        float overlimitAlarmSwitchIb;            // Ib越限报警投退
        float overlimitAlarmSwitchIc;            // Ic越限报警投退
        float uplimitCurrentI;                   // 电流上限定值
        float downlimitCurrentI;                 // 电流下限定值
        float overlimitAlarmSwitchU0;            // 零序电压越限投退
        float uplimitVoltageU0;                  // 零序电压上限定值
        float downlimitVoltageU0;                // 零序电压下限定值
        float overlimitAlarmSwitchI0;            // 零序电流越限投退
        float uplimitCurrentI0;                  // 零序电流上限定值
        float downlimitCurrentI0;                // 零序电流下限定值
        float overlimitAlarmSwitchDC_U;          // 直流电压越限投退
        float uplimitDCVoltageU;                 // 直流电压上限定值
        float downlimitDCVoltageU;               // 直流电压下限定值
        float overlimitAlarmSwitchDC_I;          // 直流电流越限投退
        float uplimitDCCurrentI;                 // 直流电流上限定值
        float downlimitDCCurrentI;               // 直流电流下限定值
        float heavyOverloadSwitch;               // 重过载保护投退
        float heavyOverloadValue;                // 重过载定值
        float heavyOverloadFactor;               // 重过载返回系数
        float heavyOverloadTime;                 // 重过载延时
        float overloadSwitch;                    // 过负荷保护投退
        float overloadValue;                     // 过负荷定值
        float overloadFactor;                    // 过负荷返回系数
        float overloadTime;                      // 过负荷延时
        float batteryLowVoltageAlarmSwitch;      // 蓄电池低压报警投退
        float batteryLowVoltageValue;            // 电池低压定值
        float batteryLowVoltageFactor;           // 电池低压返回系数
        float batteryLowVoltageTime;             // 电池低压延时
        float batteryActiveSwitch;               // 电池活化周期投退
        float batteryActiveCycle;                // 电池活化周期(天)
        float batteryActiveTime;                 // 电池活化时间(h)
        float batteryActiveFaultVoltage;         // 电池活化故障电压
        float batteryActiveFaultTime;            // 电池活化故障延时
        float automaticResetEnable;              // 自动复归使能
        float automaticResetTime;                // 自动复位时间
        float overVoltageSwitch;                 // 过压投退
        float overVoltageValue;                  // 过压定值
        float overVoltageTime;                   // 过压时间
        float overVoltageFactor;                 // 过压返回系数
        float overFrequencySwitch;               // 过频投退
        float overFrequencyValue;                // 过频定值
        float overFrequencyTime;                 // 过频时间
        float overFrequencyFactor;               // 过频返回系数
        float downVoltageSwitch;                 // 低压投退
        float downVoltageValue;                  // 低压定值
        float downVoltageTime;                   // 低压时间
        float downVoltageFactor;                 // 低压返回系数
        float downFrequencySwitch;               // 低频投退
        float downFrequencyValue;                // 低频定值
        float downFrequencyTime;                 // 低频时间
        float downFrequencyFactor;               // 低频返回系数
        float closingLoopSwitch;                 // 合环功能投退
        float voltageDifference;                 // 两侧压差
        float phaseAngleDifference;				 // 相角差
        float controlloopAnomalyEnable;          // 控制回路异常使能
    } Str;

    float buf[sizeof(struct Public) / sizeof(float)];
} PublicValue;

// 断路器定值
typedef union TagBreakerValue
{
    struct Breaker
    {
        float inverseSwitch;                     // 反时限投退
        float inverseCurrentValue;               // 反时限保护电流值
        float inverseTime;                       // 反时限保护延时
        float iaccSwitch;                        // 后加速投退 软压板定值，可以选择“投入”、“退出"
        float iaccCurrentValue;                  // 后加速电流 电流定值，整定范围：00.00s~99.99A
        float iaccTime;                          // 后加速时间 时间定值，整定范围：00.00s~99.99s
        float inrushSwitch;                      // 涌流抑制投退 软压板定值，可以选择“投入”、“退出”
        float inrushTime;                        // 涌流抑制时间 时间定值，整定范围：0000~9999ms
        float secondaryRecloseLockSwitch;        // 二次重合闸闭锁投退
        float secondaryRecloseLockTime;          // 闭锁二次重合闸时间 时间定值，整定范围：00.00s~99.99
        float recloseTimesI;                     // 重合闸次数 可以选择：0，1，2，3，4
        float recloseTimesI0;                    // 零序重合闸次数 可以选择：0，1，2
        float recloseTimer1;                     // 1次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer2;                     // 2次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer3;                     // 3次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer4;                     // 4次重合闸时间 时间定值，整定范围：00.00s~99.99s
		float reResetTime;						 // 重合闸复位时间
		float rechargeTime;						 // 重合闸充电时间
		
