jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
    } Str;

    float buf[sizeof(struct Breaker) / sizeof(float)];
} BreakerValue;

// 负荷开关定值
typedef union TagLoadSwitchValue
{
    struct LoadSwitch
    {
        float currentValue;                      // 电流定值
        float voltageValue;                      // 电压定值
        float faultCheckYTime;                   // 故障检测Y时间
        float shortLockedOpeningTime;            // 短时闭锁分闸时间
        float lossElectricitySwitch;             // 失电分闸投退 “1投入”、“0退出”
        float lossOpeningTime;                   // 分闸时间
        float getVoltageClossingSwitch;          // 得电合闸投退
        float getVoltageClossingXTime;           // 得电延时合闸X时间
        float singleLossVoltageSwitch;           // 单侧失压延时合闸
        float singleLossVoltageXLTime;           // 单侧失压延时XL时间
        float doubleVoltageSwitch;               // 双侧有压禁止合闸投退
        float remainVoltageSwitch;               // 残压脉冲投退
        float remainVoltageValue;                // 残压定值
        float voltageU0Switch;                   // 零序电压保护投退
        float voltageU0Value;                    // 零序电压值
        float voltageU0Time;                     // 零序电压延时
        float breakingCurrentSwitch;             // 非遮断电流投退
        float breakingCurrentValue;        		 // 非遮断电流
    }Str;
    
    float buf[sizeof(struct LoadSwitch) / sizeof(float)];
} LoadSwitchValue;

/* common操作结构体 */
struct CommonInfo
{
    uint8_t operateType; // 操作类型 SOE/定值
    uint32_t num;        // 定值数量
    uint8_t sn;          // 定值区号
};

/* 定值数据结构体 */
typedef union TagParameter
{
    struct SN0
    {
        InherentPara inherentPara;         // 终端固有参数存储区
        RunParameter runPara;              // 终端运行参数存储区
        CalibrateFactor calibrateFactor;   // 校准系数     
    }Data;       

    //float value[sizeof(struct SN0) / sizeof(float)];
}Parameter;

typedef union TagFixedValue
{
    struct SN1_2
    {
        PublicValue publicValue;           // 公共定值
        BreakerValue breakerValue;         // 断路器定值
        LoadSwitchValue loadSwitchValue;   // 负荷开关定值
    }Data;    

    float value[sizeof(struct SN1_2) / sizeof(float)];    
}FixedValue;

/* 定值/参数操作结构体 */
struct ValueParameterOperate
{
    uint8_t type;        // 操作类型 预置/固化/撤回
    uint32_t num;        // 定值数量
    uint32_t len;        // 预置字节数
    uint8_t operateSN;   // 操作定值区号
    uint8_t currentSN;   // 当前运行定值区号
    uint8_t calibratFlag;// 校准标志
};


typedef struct TagValueParameterStr
{
    uint16_t addr;
    uint8_t tag;
    uint8_t length;
} ValueParameterStr;

struct ValueParaPreset
{
    ValueParameterStr property[VALUE_PARAMETER_TOTAL_NUM];
    float value[VALUE_PARAMETER_TOTAL_NUM * 4 + 24];
};

/* RECORD ----------------------------------------------------------------------*/
/* COS数据结构体 */
__packed struct COS_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
};

/* SOE数据结构体 */
__packed struct SOE_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

/* CO数据结构体 */
__packed struct CO_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

/* 变化遥测数据结构体 */
__packed struct NVA_Str
{
    rt_uint16_t addr;
    float value;
};

/* 故障事件数据结构体 */
__packed struct FEVENT_Str
{
    rt_uint8_t yx_num;
    rt_uint8_t yx_type;
    struct SOE_Str yx[1];
    rt_uint8_t yc_num;
    rt_uint8_t yc_type;
    struct NVA_Str yc[10];
};

/* ULOG数据结构体 */
__packed struct ULOG_Str
{
    rt_uint16_t addr;
    char description[24];
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

struct Queue_Flag_Str
{
    rt_uint16_t full;
    rt_uint16_t in;
    rt_uint16_t out[DEV_MAX_NUM];
};

struct Fatfs_Flag_Str
{
    rt_uint16_t fullnum;
    rt_uint16_t currentnum;
};

/* memory数据结构体 */
struct MEMORY_FLAG_Str
{
    struct Queue_Flag_Str queue_soe;
    struct Queue_Flag_Str queue_soe_new;
    struct Queue_Flag_Str queue_co;
    struct Queue_Flag_Str queue_fevent;
    struct Queue_Flag_Str queue_ulog;
    struct Fatfs_Flag_Str fatfs_soe;
    struct Fatfs_Flag_Str fatfs_co;
    struct Fatfs_Flag_Str fatfs_fevent;
    struct Fatfs_Flag_Str fatfs_ulog;
};

/* LOCK ----------------------------------------------------------------------*/
/* 通讯互锁定时 */
#define COMMUNICATLOCKFUC         0xF0000000 //功能
#define COMMUNICATLOCKCLRCON      0x10000000 //清零
#define COMMUNICATLOCKRESET       0x20000000 //复位标志
#define COMMUNICATLOCKRECORD      0x40000000 //有数据存贮
#define COMMUNICATLOCKCLEAR       0x80000000 //清除记录

#define COMMUNICATLOCKUSERSTA     0x0000FFFF //正在有设备使用
#define COMMUNICATLOCKUSERCON     0x000000FF //需要超时处理设备
#define COMMUNICATLOCKREADDIR     0x00010000 //读目录标志
#define COMMUNICATLOCKREADFILE    0x00020000 //读文件标志
#define COMMUNICATLOCKWRITEFILE   0x00040000 //写文件标志
#define COMMUNICATLOCKUSERNOCON   0x0000FF00 //不需要超时处理设备
#define COMMUNICATLOCKCOMTRADE    0x00000100 //写comtrate文件
#define COMMUNICATLOCKRANDOM      0x00000200 //写SOECO文件
#define COMMUNICATLOCKMAKEFS      0x00000400 //格式化文件
#define COMMUNICATLOCKLOSEPOWER   0x00000800 //失电

enum
{
    COM_YK=0,
    COM_PARA,
    COM_FILE,
    COM_MAX
};

/* CONFIGE ----------------------------------------------------------------------*/
/* lwip_dev */
struct lwip_dev
{
    unsigned char mac[6]; // MAC address
    unsigned char remoteip[4]; // default ip address
    unsigned char ip[4]; // ip address
    unsigned char netmask[4]; // net mask address
    unsigned char gateway[4]; // gate address
    unsigned char dns[4];  // DNS server IP Address
    volatile unsigned char dhcpstatus; 
};

struct ConfigurationSetDatabase
{
//串口配置
    uint16_t UartPort;      //左1，中2，右3
    uint16_t UartBaudRate;      //波特率 1200.2400,4800,9600,38400,115200
    uint16_t UartWordLength;    //数据位
    uint16_t UartStopBits;      //停止位
    uint16_t UartParity;        //无校验1，奇校验2，偶校验3
//串口设置
    uint16_t UartBalanMode;     //非平衡0，平衡1
    uint16_t UartSourceAddr;    //从站地址
    uint16_t UartLinkAddrSize;  //从站地址长度
    uint16_t UartASDUCotSize;   //传送原因字节数
    uint16_t UartASDUAddr;      //ASDU地址
    uint16_t UartASDUAddrSize;  //ASDU地址长度
//网口配置
    uint16_t Netip1[4]; //IP上
    uint16_t Netip2[4]; //IP下·
    uint16_t Netnetmask[4]; //子网掩码
    uint16_t Netgateway[4]; //网关
    uint16_t Netdns[4];//DNS
//网口设置
    uint16_t NetSourceAddr;//从站地址
    uint16_t NetASDUAddr;//ASDU地址
//YX设置
    uint16_t YXSetNum;//YX设置总数
    uint16_t YXSet[299];//YX设置
//YC设置
    uint16_t YCAddr[50];//值
    uint16_t YCProperty[50];//属性
//YK设置
    uint16_t YKAddr[10];//值
    uint16_t YKProperty[10];//属性
//ID设置
    uint16_t ID_Value[12];//值
};

