jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* 属性值 */
#define NEWJUDG_AND 0x2

/* 属性配置 */
#define NEWPROPERTY_JUDG    0x0003 //判断

#define NEWJUDG_PROPERTY    0x00ff //属性判断（大类）
//移位
#define NEWPROPERTY_TI      0 //类型标识
#define NEWPROPERTY_NEG     2 //取反
#define NEWPROPERTY_COE     2 //系数
#define NEWPROPERTY_SOE     4 //上送SOE
#define NEWPROPERTY_COS     6 //上送COS
#define NEWONEYX_PROPERTY   0 //属性
//判断位数
#define NEWJUDG_ADDR        0x0fff //地址判断
#define NEWJUDG_NUM         0x00ff //数量判断
#define NEWJUDG_VAULE       0x000f //值判断
#define NEWJUDG_CAL         0x000f //运算判断
//移位
#define NEWONEYX_VAULE      12 //值
#define NEWONEYX_NUM        8 //数量
#define NEWONEYX_ADDR       0 //地址
#define NEWCAL_AND          2 //与
#define NEWCAL_NEG          0 //非
#define NEWONEYX_CAL        12 //运算

/* PUBLIC VALUE ----------------------------------------------------------------------*/
/* 缓存后的数据，防止计算被打断 */
extern double g_IaSampleBuf[ADC_SAMPLE_NUM * 2]; 
extern double g_IbSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_IcSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_I0SampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UaSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UbSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UcSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_U0SampleBuf[ADC_SAMPLE_NUM * 2];

extern double g_UASampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UCSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_Udc1SampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_Udc2SampleBuf[ADC_SAMPLE_NUM * 2];

/* 线程运行状态 */
extern uint16_t g_ThreadRunSta;
/* 采样队列 */
extern rt_int8_t g_SampleQueueIn;  // 入指针
extern Queue *g_SampleQueueBuf;// __attribute__((at(SDRAM_ADDR_WAVE)));    // 数据空间
extern uint16_t g_StartWave;

/* 系统配置 */
extern struct ConfigurationSetDatabase g_ConfigurationSetDB;

/* 系统时间 */
extern struct SD2405Time g_SystemTime;

/* 遥信缓存 */
extern TelesignalDatabase   g_TelesignalDB;

/* 新遥信点表映射 */
//extern List NewList_Telesignal[TELESIGNAL_TOTAL_NUM];
extern rt_uint16_t g_NewMaxNumTelesignal;
extern rt_uint16_t g_NewToOldTelesignal[];//新点表映射

/* 遥测缓存 */
extern TelemetryDatabase    g_TelemetryDB;
extern TelemetryDatabase    g_TelemetryLastDB;
extern float g_secondHarmonicIa, g_secondHarmonicIb, g_secondHarmonicIc;
#if RT_USING_TELEMETRY_SET
extern TelemetryDatabase    g_TelemetrySetEnable;
extern TelemetryDatabase    g_TelemetrySetValue;
#endif

/* 新遥测点表映射 */
extern rt_uint16_t g_NewPropertyTelemetry[TELEMETRY_TOTAL_NUM];//新点表属性
extern rt_uint16_t g_NewAddTelemetry[TELEMETRY_TOTAL_NUM];//写入对应新地址

extern rt_uint16_t g_NewMaxNumTelemetry;//新点表个数
extern rt_uint16_t g_NewToOldTelemetry[TELEMETRY_TOTAL_NUM];//新点表映射，填原点表数组下标

/* 新遥控点表映射 */
extern rt_uint16_t g_NewToOldRemote[REMOTE_TOTAL_NUM];//新点表映射，填原点表数组下标
extern rt_uint16_t g_NewToOldPropertyRemote[REMOTE_TOTAL_NUM];//新点表属性

/* 通讯互锁标志 */
extern rt_uint32_t g_CommunicatFlag[COM_MAX];

/* 定值和参数缓存 */
extern Parameter g_ParameterDB;

extern FixedValue *g_pFixedValue;
extern FixedValue g_FixedValueDB1;
extern FixedValue g_FixedValueDB2;

/* 定值操作信息 */
extern struct ValueParameterOperate g_ValueParaOperateInfo;

/* 定值和参数预置缓存 */
extern struct ValueParaPreset g_ValueParaPresetDB;

/* 需存储记忆数据 */
extern struct MEMORY_FLAG_Str g_FlagDB;

/* COS缓存 */
extern struct COS_Str g_COSDB[COS_MAX_NUM];

/* SOE缓存 */
extern struct SOE_Str g_SOEDB[SOE_MAX_NUM];
extern struct SOE_Str g_SOENewDB[SOE_NEW_MAX_NUM];
/* CO缓存 */
extern struct CO_Str g_CoDB[CO_MAX_NUM];

/* FEVENT缓存 */
extern struct FEVENT_Str g_FeventDB[FEVENT_MAX_NUM];

/* ULOG缓存 */
extern struct ULOG_Str g_UlogDB[ULOG_MAX_NUM];

/* NVA缓存 */
extern struct NVA_Str g_NVADB[NVA_MAX_NUM];

/* COS缓存参数 */
extern rt_uint32_t g_COSDBIn;
extern rt_uint32_t g_COSDBOut[DEV_MAX_NUM];

/* NVA缓存参数 */
extern rt_uint32_t g_NVADBIn;
extern rt_uint32_t g_NVADBOut[DEV_MAX_NUM];

/* 通讯信息 */
extern struct lwip_dev g_EthW5500; // w5500 information
extern struct lwip_dev g_EthDP83848; // dp83848 

/* 通讯灯状态 */
extern rt_uint32_t g_ComLed;

/* PUBLIC FUNCTION  ----------------------------------------------------------*/
extern void rt_multi_common_data_save_value_to_fram(uint8_t sn);
extern void rt_multi_common_data_get_value_from_fram(uint8_t sn);
extern rt_uint16_t rt_multi_common_data_fram_record_write(uint8_t type, uint8_t *pBuf, uint32_t len);
extern void rt_multi_common_data_fram_update_state_write(uint8_t type);
extern void rt_multi_common_data_fram_record_read(uint8_t type, uint8_t *pBuf);
extern void rt_multi_common_data_powerdown_storage(void);


extern int rt_multi_common_data_init(void);
extern float* GetValueArray(uint16_t addr, uint8_t sn);
extern void DBRevert(uint8_t act);
extern void DBClear(void);
extern void ParameterCheck(uint8_t type);

extern uint8_t DBReadValueAreaSN(void);
extern uint8_t DBSwitchValueArea(uint8_t sn);

extern uint8_t DBWriteValue(uint8_t *pData, struct CommonInfo *pInfo);
extern uint8_t DBReadValue(uint16_t *pAddr, uint32_t num, uint8_t *pData, uint8_t sn, uint32_t *length);

extern void DBReadSystemTime(struct CP56Time2a_t *pTime);
extern void DBWriteSystemTime(struct CP56Time2a_t *pTime);

extern rt_uint8_t DBWriteSOE(uint16_t addr, rt_uint8_t state);
extern rt_uint8_t DBWriteCO(uint16_t addr, rt_uint8_t state);
extern rt_uint8_t DBWriteFEVENT(rt_uint16_t yx_addr, rt_uint16_t *yc_addr, rt_uint16_t yc_num);


extern uint8_t DB_NVA_Check(void);
extern void DBClearNVA(void);
extern float SelectRatio(rt_uint8_t ratioType, float ratioValue);  
extern void CalibrationFactorCal(uint8_t num);

extern int FloatToBin(float fl);
extern float BinToFloat(int bin);
extern uint8_t DecimalToBCD(uint8_t dec);
extern uint8_t BCDToDecimal(uint8_t bcd);
#endif 

/* END OF FILE ---------------------------------------------------------------*/
